docs/xmls/booking/retrieve/getreservationrq.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Header>
    <ns6:MessageHeader xmlns:ns2="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:ns4="http://webservices.sabre.com/pnrbuilder/v1_19" xmlns:ns5="http://services.sabre.com/res/or/v1_14" xmlns:ns6="http://www.ebxml.org/namespaces/messageHeader" xmlns:ns7="http://www.w3.org/1999/xlink" xmlns:ns8="http://www.w3.org/2000/09/xmldsig#" ns6:version="1.0">
      <ns6:From>
        <ns6:PartyId>customade.com.us</ns6:PartyId>
      </ns6:From>
      <ns6:To>
        <ns6:PartyId>sabre.com</ns6:PartyId>
      </ns6:To>
      <ns6:CPAId>IPCC</ns6:CPAId>
      <ns6:ConversationId>20230927-0206-234930.1396988237869755</ns6:ConversationId>
      <ns6:Service>GetReservationRQ</ns6:Service>
      <ns6:Action>GetReservationRQ</ns6:Action>
      <ns6:MessageData>
        <ns6:MessageId>mid:20230927-0206-23493@customade.com.us</ns6:MessageId>
        <ns6:Timestamp>2023-09-27T02:06:23</ns6:Timestamp>
      </ns6:MessageData>
    </ns6:MessageHeader>
    <ns2:Security xmlns:ns2="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:ns4="http://webservices.sabre.com/pnrbuilder/v1_19" xmlns:ns5="http://services.sabre.com/res/or/v1_14" xmlns:ns6="http://www.ebxml.org/namespaces/messageHeader" xmlns:ns7="http://www.w3.org/1999/xlink" xmlns:ns8="http://www.w3.org/2000/09/xmldsig#">
      <ns2:BinarySecurityToken>Shared/IDL:IceSess/SessMgr:1.0.IDL/Common/!ICESMS/ACPCRTD!ICESMSLB/CRT.LB!1695780383407!7245!533</ns2:BinarySecurityToken>
    </ns2:Security>
  </S:Header>
  <S:Body>
    <ns4:GetReservationRQ xmlns:ns2="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:ns4="http://webservices.sabre.com/pnrbuilder/v1_19" xmlns:ns5="http://services.sabre.com/res/or/v1_14" xmlns:ns6="http://www.ebxml.org/namespaces/messageHeader" xmlns:ns7="http://www.w3.org/1999/xlink" xmlns:ns8="http://www.w3.org/2000/09/xmldsig#" Version="1.19.0">
      <ns4:Locator>CWZTXI</ns4:Locator>
      <ns4:RequestType>Stateful</ns4:RequestType>
      <ns4:ReturnOptions xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" PriceQuoteServiceVersion="4.0.0" xsi:type="ns4:ReturnOptions">
        <ns4:SubjectAreas>
          <ns4:SubjectArea>ACTIVE</ns4:SubjectArea>
          <ns4:SubjectArea>ANCILLARY</ns4:SubjectArea>
          <ns4:SubjectArea>FARE_TYPE</ns4:SubjectArea>
          <ns4:SubjectArea>PRICING_INFORMATION</ns4:SubjectArea>
          <ns4:SubjectArea>PRICE_QUOTE</ns4:SubjectArea>
        </ns4:SubjectAreas>
        <ns4:ViewName>Full</ns4:ViewName>
        <ns4:ResponseFormat>STL</ns4:ResponseFormat>
      </ns4:ReturnOptions>
    </ns4:GetReservationRQ>
  </S:Body>
</S:Envelope>
